app1/app/controllers/posts_controller.rb

def create
 user=User.find(params[:user_id])
 post=user.posts.create(params[:post])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
INSERT INTO `posts` (`created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES ('2013-02-02 17:19:54', 'Hi all', 'Hi', '2013-02-02 17:19:54', 4)

def show
  @user = User.find(params[:user_id])
 @post= @user.posts.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 4 AND `posts`.`id` = 'user_id' LIMIT 1

def index
  @user =User.find(params[:user_id])
  @posts=@user.posts.find(:all)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1

def edit
 @user=User.find(params[:user_id])
 @post=@user.posts.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 'post' LIMIT 1

def update
  @user=User.find(params[:user_id])
  @post=@user.posts.find(params[:id])
  @post.update_attributes(params[:post])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 4 AND `posts`.`id` = 5 LIMIT 1
UPDATE `posts` SET `description` = 'M happy !!', `updated_at` = '2013-02-03 15:35:49' WHERE `posts`.`id` = 5

def destroy
@user = User.find(params[:user_id])
 @post= @user.posts.find(params[:id])
 @post.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 2 AND `posts`.`id` = 4 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1