app1/app/controllers/users_controller.rb

INSERT INTO `users` (`age`, `contact_no`, `created_at`, `dept`, `email`, `roll`, `updated_at`, `user_name`) VALUES (24, 9038355967, '2013-02-05 15:27:16', 'Cse', 'abcde@xyz.com', 33, '2013-02-05 15:27:16', 'Abc')
---
 def create
  user=User.create(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1
UPDATE `users` SET `contact_no` = 9038355967, `updated_at` = '2013-02-05 09:40:27' WHERE `users`.`id` = 1
---
 def update
  user=User.find(params[:user])
  user.update_attribute

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
 def destroy
  user=User.find(params[:id])
  user.destroy